EDT/УТ/src/Documents/ПриемДСОтЭкипажейУдаленногоЗакрытия/ПриемДСОтЭкипажейУдаленногоЗакрытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемДСОтЭкипажейУдаленногоЗакрытия</name>
  <registerRecords>InformationRegister.СтатусыДвиженияПриложенныхДокументов</registerRecords>
  <registerRecords>InformationRegister.СостояниеДСПриУдаленномЗакрытии</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ОтчетПоДСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПринятая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОжидаемая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОжидаемаяНаличные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПринятаяНаличные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходДС</name>
    <type>
      <types>DocumentRef.ПриходДСПоОтчетуВодителя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>CatalogRef.ТипыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКПринятию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПринятаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПринята</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПодписаниеИВозвратСопрДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПодписаниеИВозвратБНДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПереподписаниеСопрДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СопрДокументыВКоробке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СопрДокументПоступил</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНеУчитывается</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатДоставки</name>
      <type>
        <types>CatalogRef.новаРезультатМестнойДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНеВыполнения</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказаКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЮрЛицо</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЧековОбщая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнтернетМагазин</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СостояниеДСПриУдаленномЗакрытии/СостояниеДСПриУдаленномЗакрытии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеДСПриУдаленномЗакрытии</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>ДСПринятыКассиром</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СтатусыДвиженияПриложенныхДокументов/СтатусыДвиженияПриложенныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДвиженияПриложенныхДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыДвиженияПриложенныхДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПриложенногоДокумента</name>
    <type>
      <types>CatalogRef.ВидыПриложенныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/СтатусыДвиженияПриложенныхДокументов/СтатусыДвиженияПриложенныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыДвиженияПриложенныхДокументов</name>
  <predefined>
    <items>
      <name>ДокументыВозвращеныВТК</name>
      <description>Документы возвращены в ТК</description>
    </items>
    <items>
      <name>ДокументыВозвращеныПартнеру</name>
      <description>Документы возвращены партнеру</description>
    </items>
    <items>
      <name>ДокументыНеВозвращеныВТК</name>
      <description>Документы не возвращены в ТК</description>
    </items>
    <items>
      <name>ДокументыПоступилиВТКОтПартнера</name>
      <description>Документы поступили в ТК от партнера</description>
    </items>
    <items>
      <name>ДокументыТребуютПереподписания</name>
      <description>Документы требуют переподписания</description>
    </items>
  </predefined>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаРезультатМестнойДоставки/новаРезультатМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаРезультатМестнойДоставки</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>ВыполненаЧастично</name>
      <description>Выполнена частично</description>
    </items>
    <items>
      <name>НеВыполнена</name>
      <description>Не выполнена</description>
    </items>
  </predefined>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.новаРезультатВыполненияМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныНеВыполнения</name>
    <type>
      <types>CatalogRef.новаПричиныНеВыполненияМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплатыВодителю</name>
    <comment>Если выполнена 100%</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПосещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/ПриемДСОтЭкипажейУдаленногоЗакрытия/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	//Асеев 25.08.2022 (Задача № 4881)>>>
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рейс.ТерминалДоставки КАК ТерминалДоставки
	|ИЗ
	|	Документ.Рейс КАК Рейс
	|ГДЕ
	|	Рейс.Ссылка = &Рейс";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТерминалДоставки = Выборка.ТерминалДоставки;
	//Асеев 25.08.2022 (Задача № 4881)<<<
	
	// регистр СостояниеДСПриУдаленномЗакрытии
	Движения.СостояниеДСПриУдаленномЗакрытии.Записывать = Истина;
	Движения.СостояниеДСПриУдаленномЗакрытии.Очистить();
	Для Каждого ТекСтрокаЗаказы Из Заказы Цикл
		//Асеев 25.08.2022 (Задача № 4881)>>>
		//Если Не ТекСтрокаЗаказы.СуммаПринята Тогда
		Если Не ТекСтрокаЗаказы.СуммаПринята Или ТекСтрокаЗаказы.СуммаНеУчитывается Тогда
		//Асеев 25.08.2022 (Задача № 4881)<<<
			Продолжить;
		КонецеСли;	
		Движение = Движения.СостояниеДСПриУдаленномЗакрытии.Добавить();
		Движение.Период = Дата;
		Движение.Заказ = ТекСтрокаЗаказы.Заказ;
		Движение.Рейс = Рейс;
		Движение.ДСПринятыКассиром = Истина;
		Движение.СуммаДС = ТекСтрокаЗаказы.ПринятаяСумма;
		Движение.Транспорт = Транспорт;
		Движение.Водитель = Водитель;
		Движение.ТипОплаты = ТекСтрокаЗаказы.ТипОплаты;
	КонецЦикла;

	//Асеев 25.08.2022 (Задача № 4881)>>>
	Движения.СтатусыДвиженияПриложенныхДокументов.Очистить();
	//Движения.СтатусыДвиженияПриложенныхДокументов.Записывать = Истина;
	Для Каждого СтрокаДоставки Из Заказы Цикл
		Если СтрокаДоставки.ТребуетсяПодписаниеИВозвратСопрДокументов Или СтрокаДоставки.ТребуетсяПодписаниеИВозвратБНДокументов Тогда
			Если СтрокаДоставки.СопрДокументПоступил И СтрокаДоставки.ТребуетсяПереподписаниеСопрДокумента Тогда
				Движение = Движения.СтатусыДвиженияПриложенныхДокументов.Добавить();
				Движение.Период = Дата - 1;
				Движение.Регион = ТерминалДоставки;
				Движение.Заказ = СтрокаДоставки.Заказ;
				Движение.ВидПриложенногоДокумента = Справочники.ВидыПриложенныхДокументов.СопроводительныеДокументы;
				Движение.Статус = Справочники.СтатусыДвиженияПриложенныхДокументов.ДокументыВозвращеныВТК;
				
				Движение = Движения.СтатусыДвиженияПриложенныхДокументов.Добавить();
				Движение.Период = Дата;
				Движение.Регион = ТерминалДоставки;
				Движение.Заказ = СтрокаДоставки.Заказ;
				Движение.ВидПриложенногоДокумента = Справочники.ВидыПриложенныхДокументов.СопроводительныеДокументы;
				Движение.Статус = Справочники.СтатусыДвиженияПриложенныхДокументов.ДокументыТребуютПереподписания;
			ИначеЕсли СтрокаДоставки.СопрДокументПоступил Тогда
				Движение = Движения.СтатусыДвиженияПриложенныхДокументов.Добавить();
				Движение.Период = Дата;
				Движение.Регион = ТерминалДоставки;
				Движение.Заказ = СтрокаДоставки.Заказ;
				Движение.ВидПриложенногоДокумента = Справочники.ВидыПриложенныхДокументов.СопроводительныеДокументы;
				Движение.Статус = Справочники.СтатусыДвиженияПриложенныхДокументов.ДокументыВозвращеныВТК;
			Иначе
				Движение = Движения.СтатусыДвиженияПриложенныхДокументов.Добавить();
				Движение.Период = Дата;
				Движение.Регион = ТерминалДоставки;
				Движение.Заказ = СтрокаДоставки.Заказ;
				Движение.ВидПриложенногоДокумента = Справочники.ВидыПриложенныхДокументов.СопроводительныеДокументы;
				Движение.Статус = Справочники.СтатусыДвиженияПриложенныхДокументов.ДокументыНеВозвращеныВТК;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Движения.СтатусыДвиженияПриложенныхДокументов.Записать();
	Если ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж Тогда
		РассылкаОНесданныхДокументах(ТерминалДоставки);
	КонецЕсли;
	//Асеев 25.08.2022 (Задача № 4881)<<<
	
КонецПроцедуры

//Асеев 25.08.2021 (Задача № 4649)>>>
Процедура РассылкаОНесданныхДокументах(ТерминалДоставки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Доставки", Заказы.ВыгрузитьКолонку("Заказ"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыДвиженияПриложенныхДокументовСрезПоследних.Заказ.Номер КАК НомерЗаказа,
	|	СтатусыДвиженияПриложенныхДокументовСрезПоследних.Заказ.ВладелецТовара.Наименование КАК Партнер,
	|	СтатусыДвиженияПриложенныхДокументовСрезПоследних.Регистратор ССЫЛКА Документ.ПриемДСОтЭкипажейУдаленногоЗакрытия КАК ЭтоКасса,
	|	ПриемДСОтЭкипажейУдаленногоЗакрытияЗаказы.ТипОплаты.Наименование КАК ТипОплаты,
	|	ВЫБОР
	|		КОГДА ПриемДСОтЭкипажейУдаленногоЗакрытияЗаказы.РезультатДоставки В (ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена), ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
	|			ТОГДА ПриемДСОтЭкипажейУдаленногоЗакрытияЗаказы.РезультатДоставки.Наименование
	|		ИНАЧЕ ПриемДСОтЭкипажейУдаленногоЗакрытияЗаказы.ПричинаНеВыполнения.Наименование
	|	КОНЕЦ КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыДвиженияПриложенныхДокументов.СрезПоследних(&Период, Заказ В (&Доставки)) КАК СтатусыДвиженияПриложенныхДокументовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемДСОтЭкипажейУдаленногоЗакрытия.Заказы КАК ПриемДСОтЭкипажейУдаленногоЗакрытияЗаказы
	|		ПО (ПриемДСОтЭкипажейУдаленногоЗакрытияЗаказы.Ссылка = &Ссылка)
	|			И СтатусыДвиженияПриложенныхДокументовСрезПоследних.Заказ = ПриемДСОтЭкипажейУдаленногоЗакрытияЗаказы.Заказ
	|ГДЕ
	|	СтатусыДвиженияПриложенныхДокументовСрезПоследних.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыДвиженияПриложенныхДокументов.ДокументыНеВозвращеныВТК)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоКасса,
	|	Партнер,
	|	НомерЗаказа
	|ИТОГИ ПО
	|	ЭтоКасса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриемДСОтЭкипажейУдаленногоЗакрытия.Транспорт.Наименование КАК Автомобиль,
	|	ПриемДСОтЭкипажейУдаленногоЗакрытия.Водитель.Наименование КАК Водитель,
	|	ПриемДСОтЭкипажейУдаленногоЗакрытия.Экспедитор.Наименование КАК Экспедитор
	|ИЗ
	|	Документ.ПриемДСОтЭкипажейУдаленногоЗакрытия КАК ПриемДСОтЭкипажейУдаленногоЗакрытия
	|ГДЕ
	|	ПриемДСОтЭкипажейУдаленногоЗакрытия.Ссылка = &Ссылка";
	
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	Результат = РезультатПакета[0];
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаЗаголовок = РезультатПакета[1].Выбрать();
	ВыборкаЗаголовок.Следующий();
	
	ДатаРассылки = ТекущаяДата();
	
	Макет = Документы.ПриходДСПоОтчетуВодителя.ПолучитьМакет("РассылкаОНесданныхДокументах");
	
	ТабДок = Новый ТабличныйДокумент;
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	ПараметрыОбласти = Область.Параметры;
	ПараметрыОбласти.Заполнить(ВыборкаЗаголовок);
	ПараметрыОбласти.ДатаРассылки = ДатаРассылки;
	ТабДок.Вывести(Область);
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ВыборкаЭтоКасса = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЭтоКасса.Следующий() Цикл
		
		ПараметрыОбласти = ОбластьШапка.Параметры;
		Если ВыборкаЭтоКасса.ЭтоКасса Тогда
			ПараметрыОбласти.Операции = "сдаче в кассу";
			ПараметрыОбласти.Документы = "безналичные/сопроводительные";
		Иначе
			ПараметрыОбласти.Операции = "переносе";
			ПараметрыОбласти.Документы = "безналичные";
		КонецЕсли;
		ТабДок.Вывести(ОбластьШапка);
		
		ПараметрыОбласти = ОбластьСтрока.Параметры;
		
		Выборка = ВыборкаЭтоКасса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПараметрыОбласти.Заполнить(Выборка);
			ПараметрыОбласти.НомерЗаказа = СокрЛП(ПараметрыОбласти.НомерЗаказа);
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Подвал");
	ПараметрыОбласти = Область.Параметры;
	ПараметрыОбласти.ПриходДС = ЭтотОбъект;
	ТабДок.Вывести(Область);
	
	//#Если Клиент Тогда
	//	ТабДок.Показать();
	//#КонецЕсли
	
	//ТекстПисьма = "Автомобиль: " + ВыборкаЗаголовок.Автомобиль + "<br>"
	//	+ "Водитель: " + ВыборкаЗаголовок.Водитель + "<br>"
	//	+ "Экспедитор: " + ВыборкаЗаголовок.Экспедитор + "<br>"
	//	+ "<br>"
	//	+ "При сдаче в кассу, не сданы безналичные/сопроводительные документы<br>" + ЭтотОбъект; 
		
	//Сообщить(ТекстПисьма);
		
	ИмяФайла = КаталогВременныхФайлов() + Номер + ".html";
	
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML);
	
	ТекстПисьма = Новый ТекстовыйДокумент;
	ТекстПисьма.Прочитать(ИмяФайла);
	ТекстПисьма = ТекстПисьма.ПолучитьТекст();
	
	МассивПолучателей = Новый Массив;
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		МассивПолучателей.Добавить("m.aseev@strizh-logistic.ru");
	Иначе
		Если ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж Тогда
			МассивПолучателей.Добавить("kassir@strizh-logistic.ru");
		ИначеЕсли ТерминалДоставки = Справочники.РегиональныеТерминалы.СПбСтриж Тогда
			МассивПолучателей.Добавить("kassir_spb@strizh-logistic.ru");
		КонецЕсли;
		МассивПолучателей.Добавить("logist@strizh-logistic.ru");
		МассивПолучателей.Добавить("stanislav.tumakov@strizh-logistic.ru");
		МассивПолучателей.Добавить("y.semichastnov@strizh-logistic.ru");
		МассивПолучателей.Добавить("inna.illarionova@strizh-logistic.ru");
		МассивПолучателей.Добавить("dmitry.sherbinkin@strizh-logistic.ru");
	КонецЕсли;
	
	ТекстОшибки = "";
	ОбработкаUnion = Обработки.СТРИЖ_ИнтеграцияUniOne.Создать();
	ОбработкаUnion.ОтправитьEMAIL_HTTP(МассивПолучателей, "Несданные документы " + Формат(ДатаРассылки, "ДФ=dd.MM.yyyy"), ТекстПисьма,, "Сервер 1С",, ТипТекстаПочтовогоСообщения.HTML,, ТекстОшибки,,,, Ложь);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
КонецПроцедуры
//Асеев 25.08.2021 (Задача № 4649)<<<
